Repository: python/python-docs-zh-tw
Catalog: library/*.po
Languages: ast

source: ``try`` blocks. All attributes are list of nodes to execute, except for ``handlers``, which is a list of :class:`ExceptHandler` nodes.
ast: ``try`` 區塊。除 ``handlers`` 是 :class:`ExceptHandler` 節點的串列外，其他所有屬性都是要執行之節點的串列。

source: ``try`` blocks which are followed by ``except*`` clauses. The attributes are the same as for :class:`Try` but the :class:`ExceptHandler` nodes in ``handlers`` are interpreted as ``except*`` blocks rather then ``except``.
ast: ``try`` 區塊，後面跟著 ``except*`` 子句。這些屬性與 :class:`Try` 相同，但是 ``handlers`` 中的 :class:`ExceptHandler` 節點被直譯 (interpret) 為 ``except*`` 區塊而不是 ``except``。

source: A single ``except`` clause. ``type`` is the exception type it will match, typically a :class:`Name` node (or ``None`` for a catch-all ``except:`` clause). ``name`` is a raw string for the name to hold the exception, or ``None`` if the clause doesn't have ``as foo``. ``body`` is a list of nodes.
ast: 單個 ``except`` 子句。``type`` 是會被匹配的例外型別，通常是一個 :class:`Name` 節點（或者 ``None`` 表示會捕捉到所有例外的 ``except:`` 子句）。``name`` 是用於保存例外的名稱之原始字串，如果子句沒有 ``as foo`` ，則為 ``None``。``body`` 是節點串列。

source: A ``with`` block. ``items`` is a list of :class:`withitem` nodes representing the context managers, and ``body`` is the indented block inside the context.
ast: 一個 ``with`` 區塊。``items`` 是表示情境管理器的 :class:`withitem` 節點串列，``body`` 是情境內的縮進區塊。

source: A single context manager in a ``with`` block. ``context_expr`` is the context manager, often a :class:`Call` node. ``optional_vars`` is a :class:`Name`, :class:`Tuple` or :class:`List` for the ``as foo`` part, or ``None`` if that isn't used.
ast: ``with`` 區塊中的單個情境管理器。``context_expr`` 是情境管理器，通常是一個 :class:`Call` 節點。``Optional_vars`` 是 ``as foo`` 部分的 :class:`Name`、:class:`Tuple` 或 :class:`List`，或者如果不使用則為 ``None`` 。

source: Pattern matching
ast: 模式匹配 (pattern matching)

source: A ``match`` statement. ``subject`` holds the subject of the match (the object that is being matched against the cases) and ``cases`` contains an iterable of :class:`match_case` nodes with the different cases.
ast: 一個 ``match`` 陳述式。``subject`` 保存匹配的主題（與案例匹配的物件），``cases`` 包含具有不同案例的 :class:`match_case` 節點的可疊代物件。

source: A single case pattern in a ``match`` statement. ``pattern`` contains the match pattern that the subject will be matched against. Note that the :class:`AST` nodes produced for patterns differ from those produced for expressions, even when they share the same syntax.
ast: ``match`` 陳述式中的單個案例模式。``pattern`` 包含主題將與之匹配的匹配模式。請注意，為模式生成的 :class:`AST` 節點與為運算式生成的節點不同，即使它們共享相同的語法。

source: The ``guard`` attribute contains an expression that will be evaluated if the pattern matches the subject.
ast: ``guard`` 屬性包含一個運算式，如果模式與主題匹配，則將對該運算式求值。

source: ``body`` contains a list of nodes to execute if the pattern matches and the result of evaluating the guard expression is true.
ast: ``body`` 包含一個節點串列，如果模式匹配並且為防護運算式 (guard expression) 的求值 (evaluate) 結果為真，則會執行該節點串列。

source: A match literal or value pattern that compares by equality. ``value`` is an expression node. Permitted value nodes are restricted as described in the match statement documentation. This pattern succeeds if the match subject is equal to the evaluated value.
ast: 以相等性進行比較的匹配文本或值的模式。``value`` 是一個運算式節點。允許值節點受到匹配陳述式文件中所述的限制。如果匹配主題等於求出值，則此模式成功。

source: A match literal pattern that compares by identity. ``value`` is the singleton to be compared against: ``None``, ``True``, or ``False``. This pattern succeeds if the match subject is the given constant.
ast: 按識別性 (identity) 進行比較的匹配文本模式。``value`` 是要與 ``None``、``True`` 或 ``False`` 進行比較的單例 (singleton)。如果匹配主題是給定的常數，則此模式成功。

source: A match sequence pattern. ``patterns`` contains the patterns to be matched against the subject elements if the subject is a sequence. Matches a variable length sequence if one of the subpatterns is a ``MatchStar`` node, otherwise matches a fixed length sequence.
ast: 匹配序列模式。如果主題是一個序列，``patterns`` 包含與主題元素匹配的模式。如果子模式之一是 ``MatchStar`` 節點，則匹配可變長度序列，否則匹配固定長度序列。

source: Matches the rest of the sequence in a variable length match sequence pattern. If ``name`` is not ``None``, a list containing the remaining sequence elements is bound to that name if the overall sequence pattern is successful.
ast: 以可變長度匹配序列模式匹配序列的其餘部分。如果 ``name`` 不是 ``None``，則如果整體序列模式成功，則包含其餘序列元素的串列將綁定到該名稱。

source: A match mapping pattern. ``keys`` is a sequence of expression nodes. ``patterns`` is a corresponding sequence of pattern nodes. ``rest`` is an optional name that can be specified to capture the remaining mapping elements. Permitted key expressions are restricted as described in the match statement documentation.
ast: 匹配對映模式。``keys`` 是運算式節點的序列。``patterns`` 是相應的模式節點序列。``rest`` 是一個可選名稱，可以指定它來捕獲剩餘的對映元素。允許的鍵運算式受到匹配陳述式文件中所述的限制。

source: This pattern succeeds if the subject is a mapping, all evaluated key expressions are present in the mapping, and the value corresponding to each key matches the corresponding subpattern. If ``rest`` is not ``None``, a dict containing the remaining mapping elements is bound to that name if the overall mapping pattern is successful.
ast: 如果主題是對映，所有求值出的鍵運算式都存在於對映中，並且與每個鍵對應的值與相應的子模式匹配，則此模式成功。如果 ``rest`` 不是 ``None``，則如果整體對映模式成功，則包含其餘對映元素的字典將綁定到該名稱。

source: A match class pattern. ``cls`` is an expression giving the nominal class to be matched. ``patterns`` is a sequence of pattern nodes to be matched against the class defined sequence of pattern matching attributes. ``kwd_attrs`` is a sequence of additional attributes to be matched (specified as keyword arguments in the class pattern), ``kwd_patterns`` are the corresponding patterns (specified as keyword values in the class pattern).
ast: 匹配類別模式。``cls`` 是一個給定要匹配的名義類別 (nominal class) 的運算式。``patterns`` 是要與類別定義的模式匹配屬性序列進行匹配的模式節點序列。``kwd_attrs`` 是要匹配的附加屬性序列（在類別模式中指定為關鍵字引數），``kwd_patterns`` 是相應的模式（在類別模式中指定為關鍵字的值）。

source: This pattern succeeds if the subject is an instance of the nominated class, all positional patterns match the corresponding class-defined attributes, and any specified keyword attributes match their corresponding pattern.
ast: 如果主題是指定類別的實例，所有位置模式都與相應的類別定義屬性匹配，並且任何指定的關鍵字屬性與其相應模式匹配，則此模式成功。

source: Note: classes may define a property that returns self in order to match a pattern node against the instance being matched. Several builtin types are also matched that way, as described in the match statement documentation.
ast: 注意：類別可以定義一個回傳 self 的特性 (property)，以便將模式節點與正在匹配的實例進行匹配。一些內建型別也以這種方式匹配，如同匹配陳述式文件中所述。

source: A match "as-pattern", capture pattern or wildcard pattern. ``pattern`` contains the match pattern that the subject will be matched against. If the pattern is ``None``, the node represents a capture pattern (i.e a bare name) and will always succeed.
ast: 匹配的 「as 模式 (as-pattern)」，為捕獲模式 (capture pattern) 或通配模式 (wildcard pattern)。``pattern`` 包含主題將與之匹配的匹配模式。如果模式為 ``None``，則該節點代表捕獲模式（即裸名 (bare name)）並且始終會成功。

source: The ``name`` attribute contains the name that will be bound if the pattern is successful. If ``name`` is ``None``, ``pattern`` must also be ``None`` and the node represents the wildcard pattern.
ast: ``name`` 屬性包含模式成功時將綁定的名稱。如果 ``name`` 為 ``None``，則 ``pattern`` 也必須為 ``None``，並且節點代表通配模式。

source: A match "or-pattern". An or-pattern matches each of its subpatterns in turn to the subject, until one succeeds. The or-pattern is then deemed to succeed. If none of the subpatterns succeed the or-pattern fails. The ``patterns`` attribute contains a list of match pattern nodes that will be matched against the subject.
ast: 匹配的 「or 模式 (or-pattern)」。 or 模式依次將其每個子模式與主題進行匹配，直到成功為止，然後 or 模式就會被認為是成功的。如果沒有一個子模式成功，則 or 模式將失敗。 ``patterns`` 屬性包含將與主題進行匹配的匹配模式節點串列。

source: Type parameters
ast: 型別參數 (type parameters)

source: :ref:`Type parameters <type-params>` can exist on classes, functions, and type aliases.
ast: :ref:`型別參數 <type-params>`\ 可以存在於類別、函式和型別別名上。

source: Function and class definitions
ast: 函式和類別定義

source: A function definition.
ast: 一個函式定義。

source: ``name`` is a raw string of the function name.
ast: ``name`` 是函式名稱的原始字串。

source: ``args`` is an :class:`arguments` node.
ast: ``args`` 是一個 :class:`arguments` 節點。

source: ``body`` is the list of nodes inside the function.
ast: ``body`` 是函式內節點的串列。

source: ``decorator_list`` is the list of decorators to be applied, stored outermost first (i.e. the first in the list will be applied last).
ast: ``decorator_list`` 是要應用的裝飾器串列，在最外層者會被儲存在首位（即串列中首位將會是最後一個被應用的那個）。

source: ``returns`` is the return annotation.
ast: ``returns`` 是回傳註釋。

source: ``type_params`` is a list of :ref:`type parameters <ast-type-params>`.
ast: ``type_params`` 是\ :ref:`型別參數 <ast-type-params>`\ 的串列。

source: Added ``type_params``.
ast: 新增了 ``type_params``。

source: ``lambda`` is a minimal function definition that can be used inside an expression. Unlike :class:`FunctionDef`, ``body`` holds a single node.
ast: ``lambda`` 是可以在運算式內使用的最小函式定義。與 :class:`FunctionDef` 不同，``body`` 保存單個節點。

source: The arguments for a function.
ast: 函式的引數。

source: ``posonlyargs``, ``args`` and ``kwonlyargs`` are lists of :class:`arg` nodes.
ast: ``posonlyargs``、``args`` 和 ``kwonlyargs`` 是 :class:`arg` 節點的串列。

source: ``vararg`` and ``kwarg`` are single :class:`arg` nodes, referring to the ``*args, **kwargs`` parameters.
ast: ``vararg`` 和 ``kwarg`` 是單個 :class:`arg` 節點，指的是 ``*args, **kwargs`` 參數。

source: ``kw_defaults`` is a list of default values for keyword-only arguments. If one is ``None``, the corresponding argument is required.
ast: ``kw_defaults`` 是僅限關鍵字引數的預設值串列。如果其中某個為 ``None``，則相應參數就會是必要的。

source: ``defaults`` is a list of default values for arguments that can be passed positionally. If there are fewer defaults, they correspond to the last n arguments.
ast: ``defaults`` 是可以按位置傳遞的引數的預設值串列。如果預設值較少，則它們對應於最後 n 個引數。

source: A single argument in a list. ``arg`` is a raw string of the argument name; ``annotation`` is its annotation, such as a :class:`Name` node.
ast: 串列中的單個引數。``arg`` 是引數名稱的原始字串，``annotation`` 是它的註釋，例如 :class:`Name` 節點。

source: ``type_comment`` is an optional string with the type annotation as a comment
ast: ``type_comment`` 是一個可選字串，其註解為型別註釋

source: A ``return`` statement.
ast: 一個 ``return`` 陳述式。

source: A ``yield`` or ``yield from`` expression. Because these are expressions, they must be wrapped in an :class:`Expr` node if the value sent back is not used.
ast: 一個 ``yield`` 或 ``yield from`` 運算式。因為這些是運算式，所以如果不使用發送回來的值，則必須將它們包裝在 :class:`Expr` 節點中。

source: ``global`` and ``nonlocal`` statements. ``names`` is a list of raw strings.
ast: ``global`` 和 ``nonlocal`` 陳述式。``names`` 是原始字串的串列。

source: A class definition.
ast: 一個類別定義。

source: ``name`` is a raw string for the class name
ast: ``name`` 是類別名的原始字串

source: ``bases`` is a list of nodes for explicitly specified base classes.
ast: ``bases`` 是被顯式指定的基底類別節點串列。

source: ``body`` is a list of nodes representing the code within the class definition.
ast: ``body`` 是表示類別定義中程式碼的節點串列。

source: ``decorator_list`` is a list of nodes, as in :class:`FunctionDef`.
ast: ``decorator_list`` 是一個節點串列，如 :class:`FunctionDef` 中所示。

source: Async and await
ast: async 和 await

source: An ``async def`` function definition. Has the same fields as :class:`FunctionDef`.
ast: 一個 ``async def`` 函式定義。與 :class:`FunctionDef` 具有相同的欄位。

source: An ``await`` expression. ``value`` is what it waits for. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: 一個 ``await`` 運算式。``value`` 是它等待的東西。僅在 :class:`AsyncFunctionDef` 主體 (body) 中有效。

source: ``async for`` loops and ``async with`` context managers. They have the same fields as :class:`For` and :class:`With`, respectively. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: ``async for`` 迴圈和 ``async with`` 情境管理器。它們分別具有與 :class:`For` 和 :class:`With` 相同的欄位。僅在 :class:`AsyncFunctionDef` 主體中有效。

source: When a string is parsed by :func:`ast.parse`, operator nodes (subclasses of :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` and :class:`ast.expr_context`) on the returned tree will be singletons. Changes to one will be reflected in all other occurrences of the same value (e.g. :class:`ast.Add`).
ast: 當字串被 :func:`ast.parse` 剖析時，回傳樹的運算子節點（\ :class:`ast.operator`、:class:`ast.unaryop`、:class:`ast.cmpop`、:class: :class:`ast.boolop` 和 :class:`ast.expr_context`\ ）將是單例。對其中之一的更改將反映在所有其他出現的相同值中（例如 :class:`ast.Add`\ ）。

source: :mod:`ast` Helpers
ast: :mod:`ast` 輔助程式

source: Apart from the node classes, the :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
ast: 除了節點類別之外，:mod:`ast` 模組還定義了這些用於遍歷 (traverse) 抽象語法樹的實用函式和類別：

source: If ``type_comments=True`` is given, the parser is modified to check and return type comments as specified by :pep:`484` and :pep:`526`. This is equivalent to adding :data:`ast.PyCF_TYPE_COMMENTS` to the flags passed to :func:`compile`. This will report syntax errors for misplaced type comments. Without this flag, type comments will be ignored, and the ``type_comment`` field on selected AST nodes will always be ``None``. In addition, the locations of ``# type: ignore`` comments will be returned as the ``type_ignores`` attribute of :class:`Module` (otherwise it is always an empty list).
ast: 如果給定 ``type_comments=True``，剖析器將被修改為檢查並回傳 :pep:`484` 和 :pep:`526` 指定的型別註釋。這相當於將 :data:`ast.PyCF_TYPE_COMMENTS` 新增到傳遞給 :func:`compile` 的旗標中。這將報告錯誤型別註釋的語法錯誤。如果沒有此旗標，型別註釋將被忽略，並且所選 AST 節點上的 ``type_comment`` 欄位將始終為 ``None``。此外，``# type: ignore`` 註釋的位置將作為 :class:`Module` 的 ``type_ignores`` 屬性回傳（否則它始終是一個空串列）。

source: In addition, if ``mode`` is ``'func_type'``, the input syntax is modified to correspond to :pep:`484` "signature type comments", e.g. ``(str, int) -> List[str]``.
ast: 此外，如果 ``mode`` 是 ``'func_type'``，則輸入語法將會依據 :pep:`484`\ 「簽名型別註解 (signature type comments)」而被修改，例如 ``(str, int) -> List[str]``。

source: If source contains a null character (``\0``), :exc:`ValueError` is raised.
ast: 如果來源包含 null 字元 (``\0``)，則會引發 :exc:`ValueError`。

source: Note that successfully parsing source code into an AST object doesn't guarantee that the source code provided is valid Python code that can be executed as the compilation step can raise further :exc:`SyntaxError` exceptions. For instance, the source ``return 42`` generates a valid AST node for a return statement, but it cannot be compiled alone (it needs to be inside a function node).
ast: 請注意，成功將原始碼剖析為 AST 物件並不能保證提供的原始碼是可以執行的有效 Python 程式碼，因為編譯步驟可能會引發進一步的 :exc:`SyntaxError` 例外。例如，原始的 ``return 42`` 為 return 陳述式生成一個有效的 AST 節點，但它不能單獨編譯（它需要位於函式節點內）。

source: In particular, :func:`ast.parse` won't do any scoping checks, which the compilation step does.
ast: 特別是 :func:`ast.parse` 不會執行任何範圍檢查，而編譯步驟才會執行此操作。

source: It is possible to crash the Python interpreter with a sufficiently large/complex string due to stack depth limitations in Python's AST compiler.
ast: 由於 Python AST 編譯器中的堆疊 (stack) 深度限制，太大或太複雜的字串可能會導致 Python 直譯器崩潰。

source: Added ``type_comments``, ``mode='func_type'`` and ``feature_version``.
ast: 新增 ``type_comments``、``mode='func_type'`` 與 ``feature_version``。

source: Unparse an :class:`ast.AST` object and generate a string with code that would produce an equivalent :class:`ast.AST` object if parsed back with :func:`ast.parse`.
ast: 反剖析 :class:`ast.AST` 物件並生成一個帶有程式碼的字串，如果使用 :func:`ast.parse` 剖析回來，該程式碼將生成等效的 :class:`ast.AST` 物件。

source: The produced code string will not necessarily be equal to the original code that generated the :class:`ast.AST` object (without any compiler optimizations, such as constant tuples/frozensets).
ast: 生成的程式碼字串不一定等於生成 :class:`ast.AST` 物件的原始程式碼（沒有任何編譯器最佳化，例如常數元組/凍結集合）。

source: Trying to unparse a highly complex expression would result with :exc:`RecursionError`.
ast: 嘗試剖析高度複雜的運算式會導致 :exc:`RecursionError`。

source: Evaluate an expression node or a string containing only a Python literal or container display. The string or node provided may only consist of the following Python literal structures: strings, bytes, numbers, tuples, lists, dicts, sets, booleans, ``None`` and ``Ellipsis``.
ast: 為僅包含 Python 文本或容器之顯示的運算式節點或字串來求值。提供的字串或節點只能包含以下 Python 文本結構：字串、位元組、數字、元組、串列、字典、集合、布林值、``None`` 和 ``Ellipsis``。

source: This can be used for evaluating strings containing Python values without the need to parse the values oneself. It is not capable of evaluating arbitrarily complex expressions, for example involving operators or indexing.
ast: 這可用於為包含 Python 值的字串求值，而無需自己剖析這些值。它無法計算任意複雜的運算式，例如涉及運算子或索引。

source: This function had been documented as "safe" in the past without defining what that meant. That was misleading. This is specifically designed not to execute Python code, unlike the more general :func:`eval`. There is no namespace, no name lookups, or ability to call out. But it is not free from attack: A relatively small input can lead to memory exhaustion or to C stack exhaustion, crashing the process. There is also the possibility for excessive CPU consumption denial of service on some inputs. Calling it on untrusted data is thus not recommended.
ast: 該函式過去被記錄為「安全」，但沒有定義其含義，這有點誤導讀者，它是特別設計為不去執行 Python 程式碼，與更通用的 :func:`eval` 不同。沒有命名空間、沒有名稱查找、也沒有呼叫的能力。但它也不能免受攻擊：相對較小的輸入可能會導致記憶體耗盡或 C 堆疊耗盡，從而導致行程崩潰。某些輸入也可能會出現 CPU 消耗過多而導致拒絕服務的情況。因此不建議在不受信任的資料上呼叫它。

source: It is possible to crash the Python interpreter due to stack depth limitations in Python's AST compiler.
ast: 由於 Python AST 編譯器的堆疊深度限制，Python 直譯器可能會崩潰。

source: It can raise :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` and :exc:`RecursionError` depending on the malformed input.
ast: 它可能會引發 :exc:`ValueError`、:exc:`TypeError`、:exc:`SyntaxError`、:exc:`MemoryError` 和 :exc:`RecursionError`，具體取決於格式錯誤的輸入。

source: Now allows bytes and set literals.
ast: 現在允許位元組和集合文本 (set literal)。

source: Now supports creating empty sets with ``'set()'``.
ast: 現在支援使用 ``'set()'`` 建立空集合。

source: For string inputs, leading spaces and tabs are now stripped.
ast: 對於字串輸入，前導空格和定位字元 (tab) 現在已被去除。

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
ast: 回傳給定 *node* 的文件字串 (docstring)（必須是 :class:`FunctionDef`、:class:`AsyncFunctionDef`、:class:`ClassDef` 或 :class:`Module` 節點）或如果它沒有文件字串則為 ``None``。如果 *clean* 為 true，則使用 :func:`inspect.cleandoc` 清理文件字串的縮排。

source: :class:`AsyncFunctionDef` is now supported.
ast: 目前已支援 :class:`AsyncFunctionDef`。

source: Get source code segment of the *source* that generated *node*. If some location information (:attr:`~ast.AST.lineno`, :attr:`~ast.AST.end_lineno`, :attr:`~ast.AST.col_offset`, or :attr:`~ast.AST.end_col_offset`) is missing, return ``None``.
ast: 獲取生成 *node* 的 *source* 的原始碼片段。如果某些位置資訊（:attr:`~ast.AST.lineno`、:attr:`~ast.AST.end_lineno`、:attr:`~ast.AST.col_offset` 或 :attr:`~ast.AST.end_col_offset`\ ）遺漏，則回傳 ``None``。

source: If *padded* is ``True``, the first line of a multi-line statement will be padded with spaces to match its original position.
ast: 如果 *padded* 為 ``True``，則多列陳述式的第一列將用空格填充 (padded) 以匹配其原始位置。

source: When you compile a node tree with :func:`compile`, the compiler expects :attr:`~ast.AST.lineno` and :attr:`~ast.AST.col_offset` attributes for every node that supports them. This is rather tedious to fill in for generated nodes, so this helper adds these attributes recursively where not already set, by setting them to the values of the parent node. It works recursively starting at *node*.
ast: 當你使用 :func:`compile` 編譯節點樹時，對於每個有支援 :attr:`~ast.AST.lineno` 和 :attr:`~ast.AST.col_offset` 屬性之節點，編譯器預期他們的這些屬性都要存在。填入生成的節點相當繁瑣，因此該輔助工具透過將這些屬性設定為父節點的值，在尚未設定的地方遞迴地新增這些屬性。它從 *node* 開始遞迴地作用。

source: Increment the line number and end line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
ast: 將樹中從 *node* 開始的每個節點的列號和結束列號增加 *n*。這對於「移動程式碼」到檔案中的不同位置很有用。

source: Copy source location (:attr:`~ast.AST.lineno`, :attr:`~ast.AST.col_offset`, :attr:`~ast.AST.end_lineno`, and :attr:`~ast.AST.end_col_offset`) from *old_node* to *new_node* if possible, and return *new_node*.
ast: 如果可行，將原始位置（:attr:`~ast.AST.lineno`、:attr:`~ast.AST.col_offset`、:attr:`~ast.AST.end_lineno` 和 :attr:`~ast.AST.end_col_offset` ）從 *old_node* 複製到 *new_node*，並回傳 *new_node* 。

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
ast: 為 *node* 上存在的 ``node._fields`` 中的每個欄位生成一個 ``(fieldname, value)`` 元組。

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
ast: 生成 *node* 的所有直接子節點，即作為節點的所有欄位以及作為節點串列欄位的所有項目。

source: Recursively yield all descendant nodes in the tree starting at *node* (including *node* itself), in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
ast: 遞迴地生成樹中從 *node* 開始的所有後代節點（包括 *node* 本身），不按指定順序。如果你只想就地修改節點而不關心情境，這非常有用。

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
ast: 節點訪問者基底類別，它遍歷抽象語法樹並為找到的每個節點呼叫訪問者函式。該函式可能會回傳一個由 :meth:`visit` 方法轉發的值。

source: This class is meant to be subclassed, with the subclass adding visitor methods.
ast: 這個類別應該被子類別化，子類別新增訪問者方法。

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
ast: 訪問一個節點。預設實作呼叫名為 :samp:`self.visit_{classname}` 的方法，其中 *classname* 是節點類別的名稱，或者在該方法不存在時呼叫 :meth:`generic_visit`。

source: This visitor calls :meth:`visit` on all children of the node.
ast: 該訪問者對該節點的所有子節點呼叫 :meth:`visit`。

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
ast: 請注意，除非訪問者呼叫 :meth:`generic_visit` 或訪問它們本身，否則不會訪問具有自定義訪問者方法的節點之子節點。

source: Handles all constant nodes.
ast: 處理所有常數節點。

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
ast: 如果你想在遍歷期間將變更應用 (apply) 於節點，請不要使用 :class:`NodeVisitor`。為此，有個允許修改的特殊遍歷訪問者工具 :class:`NodeTransformer`。

source: Methods :meth:`!visit_Num`, :meth:`!visit_Str`, :meth:`!visit_Bytes`, :meth:`!visit_NameConstant` and :meth:`!visit_Ellipsis` are deprecated now and will not be called in future Python versions. Add the :meth:`visit_Constant` method to handle all constant nodes.
ast: :meth:`!visit_Num`、:meth:`!visit_Str`、:meth:`!visit_Bytes`、:meth:`!visit_NameConstant` 和 :meth:`!visit_Ellipsis` 方法現已棄用，並且不會在未來的Python 版本中被呼叫。新增 :meth:`visit_Constant` 方法來處理所有常數節點。

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
ast: 一個 :class:`NodeVisitor` 子類別，它會遍歷抽象語法樹並允許修改節點。

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
ast: :class:`NodeTransformer` 將遍歷 AST 並使用訪問者方法的回傳值來替換或刪除舊節點。如果訪問者方法的回傳值為 ``None``，則該節點將從其位置中刪除，否則將被替換為回傳值。回傳值可能是原始節點，在這種情況下不會發生替換。

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
ast: 下面是一個示範用的 transformer，它將查找所有出現名稱 (``foo``) 並改寫為 ``data['foo']``： ::

source: Keep in mind that if the node you're operating on has child nodes you must either transform the child nodes yourself or call the :meth:`~ast.NodeVisitor.generic_visit` method for the node first.
ast: 請記住，如果你正在操作的節點有子節點，你必須自己轉換子節點或先呼叫該節點的 :meth:`~ast.NodeVisitor.generic_visit` 方法。
