Repository: python/python-docs-zh-tw
Catalog: library/*.po
Languages: ast

source: :mod:`!ast` --- Abstract Syntax Trees
ast: :mod:`!ast` --- 抽象語法樹 (Abstract Syntax Trees)

source: **Source code:** :source:`Lib/ast.py`
ast: **原始碼：**\ :source:`Lib/ast.py`

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
ast: :mod:`ast` 模組可以幫助 Python 應用程式處理 Python 抽象語法文法 (abstract syntax grammar) 樹狀資料結構。抽象語法本身可能會隨著每個 Python 版本發布而改變；此模組有助於以程式化的方式來得知當前文法的面貌。

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
ast: 要生成抽象語法樹，可以透過將 :data:`ast.PyCF_ONLY_AST` 作為旗標傳遞給內建函式 :func:`compile` 或使用此模組所提供的 :func:`parse` 輔助函式。結果將會是一個物件的樹，其類別都繼承自 :class:`ast.AST`。可以使用內建的 :func:`compile` 函式將抽象語法樹編譯成 Python 程式碼物件。

source: Abstract Grammar
ast: 抽象文法 (Abstract Grammar)

source: The abstract grammar is currently defined as follows:
ast: 抽象文法目前定義如下：

source: Node classes
ast: 節點 (Node) 類別

source: This is the base of all AST node classes. The actual node classes are derived from the :file:`Parser/Python.asdl` file, which is reproduced :ref:`above <abstract-grammar>`. They are defined in the :mod:`!_ast` C module and re-exported in :mod:`ast`.
ast: 這是所有 AST 節點類別的基礎。實際的節點類別是衍生自 :file:`Parser/Python.asdl` 檔案，該檔案在\ :ref:`上方 <abstract-grammar>` 重現。它們被定義於 :mod:`!_ast` 的 C 模組中，並於 :mod:`ast` 中重新匯出。

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
ast: 抽象文法中為每個左側符號定義了一個類別（例如 :class:`ast.stmt` 或 :class:`ast.expr`\ ）。此外，也為每個右側的建構函式 (constructor) 定義了一個類別；這些類別繼承自左側樹的類別。例如，:class:`ast.BinOp` 繼承自 :class:`ast.expr`。對於具有替代方案（即為「和 (sums)」）的生產規則，左側類別是抽象的：僅有特定建構函式節點的實例會被建立。

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
ast: 具體類別的每個實例對於每個子節點都有一個屬性，其型別如文法中所定義。例如，:class:`ast.BinOp` 實例具有型別為 :class:`ast.expr` 的屬性 :attr:`left`。

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
ast: 如果這些屬性在文法中被標記為可選（使用問號），則該值可能為 ``None``。如果屬性可以有零個或多個值（用星號標記），則這些值將表示為 Python 串列。使用 :func:`compile` 編譯 AST 時，所有可能的屬性都必須存在並且具有有效值。

source: Instances of :class:`ast.expr` and :class:`ast.stmt` subclasses have :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset` attributes. The :attr:`lineno` and :attr:`end_lineno` are the first and last line numbers of source text span (1-indexed so the first line is line 1) and the :attr:`col_offset` and :attr:`end_col_offset` are the corresponding UTF-8 byte offsets of the first and last tokens that generated the node. The UTF-8 offset is recorded because the parser uses UTF-8 internally.
ast: :class:`ast.expr` 和 :class:`ast.stmt` 子類別的實例具有 :attr:`lineno`、:attr:`col_offset`、:attr:`end_lineno` 和 :attr:`end_col_offset` 屬性。:attr:`lineno` 和 :attr:`end_lineno` 是原始文本跨度 (source text span) 的第一個和最後一個列號（1-indexed，因此第一列號是 1）以及 :attr:`col_offset` 和 :attr:`end_col_offset` 是生成節點的第一個和最後一個標記對應的 UTF-8 位元組偏移量。會記錄 UTF-8 偏移量是因為剖析器 (parser) 內部使用 UTF-8。

source: Note that the end positions are not required by the compiler and are therefore optional. The end offset is *after* the last symbol, for example one can get the source segment of a one-line expression node using ``source_line[node.col_offset : node.end_col_offset]``.
ast: 請注意，編譯器並不需要結束位置，因此其為可選的。結束偏移量在最後一個符號\ *之後*，例如可以使用 ``source_line[node.col_offset : node.end_col_offset]`` 來獲取單列運算式節點 (expression node) 的原始片段。

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
ast: :class:`ast.T` 類別的建構函式按以下方式剖析其引數：

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
ast: 如果有位置引數，則必須與 :attr:`T._fields` 中的項目一樣多；它們將被賦値為這些名稱的屬性。

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
ast: 如果有關鍵字引數，它們會將相同名稱的屬性設定為給定值。

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
ast: 例如，要建立並填充 (populate) :class:`ast.UnaryOp` 節點，你可以使用： ::

source: Class :class:`ast.Constant` is now used for all constants.
ast: :class:`ast.Constant` 類別現在用於所有常數。

source: Simple indices are represented by their value, extended slices are represented as tuples.
ast: 以它們的值表示簡單索引，擴充切片 (slice) 則以元組 (tuple) 表示。

source: Old classes :class:`!ast.Num`, :class:`!ast.Str`, :class:`!ast.Bytes`, :class:`!ast.NameConstant` and :class:`!ast.Ellipsis` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: 舊的類別 :class:`!ast.Num`、:class:`!ast.Str`、:class:`!ast.Bytes`、:class:`!ast.NameConstant` 和 :class:`!ast.Ellipsis` 仍然可用，但它們將在未來的 Python 釋出版本中移除。與此同時，實例化它們將回傳不同類別的實例。

source: Old classes :class:`!ast.Index` and :class:`!ast.ExtSlice` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: 舊的類別 :class:`!ast.Index` 和 :class:`!ast.ExtSlice` 仍然可用，但它們將在未來的 Python 版本中刪除。同時，實例化它們會回傳不同類別的實例。

source: The descriptions of the specific node classes displayed here were initially adapted from the fantastic `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ project and all its contributors.
ast: 這裡顯示的特定節點類別的描述最初是從出色的 `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ 專案和所有貢獻者那裡改編而來的。

source: Root nodes
ast: 根節點

source: A Python module, as with :ref:`file input <file-input>`. Node type generated by :func:`ast.parse` in the default ``"exec"`` *mode*.
ast: 一個 Python 模組，與\ :ref:`檔案輸入 <file-input>` 一樣。由 :func:`ast.parse` 在預設的 ``"exec"`` *mode* 下生成的節點型別。

source: *body* is a :class:`list` of the module's :ref:`ast-statements`.
ast: *body* 是模組的\ :ref:`ast-statements` 的一個 :class:`list`。

source: *type_ignores* is a :class:`list` of the module's type ignore comments; see :func:`ast.parse` for more details.
ast: *type_ignores* 是模組的忽略型別註解的 :class:`list`；有關更多詳細資訊，請參閱 :func:`ast.parse`。

source: A single Python :ref:`expression input <expression-input>`. Node type generated by :func:`ast.parse` when *mode* is ``"eval"``.
ast: 單個 Python :ref:`運算式輸入 <expression-input>`。當 *mode* 是 ``"eval"`` 時節點型別由 :func:`ast.parse` 生成。

source: *body* is a single node, one of the :ref:`expression types <ast-expressions>`.
ast: *body* 是單個節點，是\ :ref:`運算式型別 <ast-expressions>`\ 的其中之一。

source: A single :ref:`interactive input <interactive>`, like in :ref:`tut-interac`. Node type generated by :func:`ast.parse` when *mode* is ``"single"``.
ast: 單個\ :ref:`互動式輸入 <interactive>`，和\ :ref:`tut-interac`\ 中所述的相似。當 *mode* 是 ``"single"`` 時節點型別由 :func:`ast.parse` 生成。

source: *body* is a :class:`list` of :ref:`statement nodes <ast-statements>`.
ast: *body* 是\ :ref:`陳述式節點 (statement nodes) <ast-statements>` 的 :class:`list`。

source: A representation of an old-style type comments for functions, as Python versions prior to 3.5 didn't support :pep:`484` annotations. Node type generated by :func:`ast.parse` when *mode* is ``"func_type"``.
ast: 函式的舊式型別註解的表示法，因為 3.5 之前的 Python 版本不支援 :pep:`484` 註釋。當 *mode* 是 ``"func_type"`` 時節點型別由 :func:`ast.parse` 生成。

source: Such type comments would look like this::
ast: 這種型別的註解看起來像這樣： ::

source: *argtypes* is a :class:`list` of :ref:`expression nodes <ast-expressions>`.
ast: *argtypes* 是\ :ref:`運算式節點 <ast-expressions>`\ 的 :class:`list`。

source: *returns* is a single :ref:`expression node <ast-expressions>`.
ast: *returns* 是單個\ :ref:`運算式節點 <ast-expressions>`。

source: Literals
ast: 文本 (Literals)

source: A constant value. The ``value`` attribute of the ``Constant`` literal contains the Python object it represents. The values represented can be simple types such as a number, string or ``None``, but also immutable container types (tuples and frozensets) if all of their elements are constant.
ast: 一個常數值。``Constant`` 文本的 ``value`` 屬性包含它所代表的 Python 物件。表示的值可以是簡單型別，例如數字、字串或 ``None``，但如果它們的所有元素都是常數，也可以是不可變的 (immutable) 容器型別（元組和凍結集合 (frozensets)）。

source: Node representing a single formatting field in an f-string. If the string contains a single formatting field and nothing else the node can be isolated otherwise it appears in :class:`JoinedStr`.
ast: 表示 f 字串 (f-string) 中的單個格式化欄位的節點。如果字串包含單個格式欄位並且沒有其他內容，則可以隔離 (isolate) 該節點，否則它將出現在 :class:`JoinedStr` 中。

source: ``value`` is any expression node (such as a literal, a variable, or a function call).
ast: ``value`` 為任何運算式節點（例如文字、變數或函式呼叫）。

source: ``conversion`` is an integer:
ast: ``conversion`` 是一個整數：

source: -1: no formatting
ast: -1: 無格式化

source: 115: ``!s`` string formatting
ast: 115: ``!s`` 字串格式化

source: 114: ``!r`` repr formatting
ast: 114:``!r`` 重複格式化化

source: 97: ``!a`` ascii formatting
ast: 97: ``！a`` ascii 格式化

source: ``format_spec`` is a :class:`JoinedStr` node representing the formatting of the value, or ``None`` if no format was specified. Both ``conversion`` and ``format_spec`` can be set at the same time.
ast: ``format_spec`` 是一個 :class:`JoinedStr` 節點，表示值的格式，若未指定格式則為 ``None``。``conversion`` 和 ``format_spec`` 可以同時設定。

source: An f-string, comprising a series of :class:`FormattedValue` and :class:`Constant` nodes.
ast: 一個 f 字串，包含一系列 :class:`FormattedValue` 和 :class:`Constant` 節點。

source: A list or tuple. ``elts`` holds a list of nodes representing the elements. ``ctx`` is :class:`Store` if the container is an assignment target (i.e. ``(x,y)=something``), and :class:`Load` otherwise.
ast: 串列或元組。``elts`` 保存表示元素的節點串列。如果容器是賦值目標（即 ``(x,y)=something`` ），則 ``ctx`` 是 :class:`Store`，否則是 :class:`Load`。

source: A set. ``elts`` holds a list of nodes representing the set's elements.
ast: 一個集合。``elts`` 保存表示集合之元素的節點串列。

source: A dictionary. ``keys`` and ``values`` hold lists of nodes representing the keys and the values respectively, in matching order (what would be returned when calling :code:`dictionary.keys()` and :code:`dictionary.values()`).
ast: 一個字典 (dictionary)。``keys`` 和 ``values`` 分別按匹配順序保存表示鍵和值的節點串列（為呼叫 :code:`dictionary.keys()` 和 :code:`dictionary.values()` 時將回傳的內容）。

source: When doing dictionary unpacking using dictionary literals the expression to be expanded goes in the ``values`` list, with a ``None`` at the corresponding position in ``keys``.
ast: 當使用字典文本進行字典解包 (unpack) 時，要擴充的運算式位於 ``values`` 串列中，在 ``keys`` 中的相應位置有一個 ``None``。

source: Variables
ast: 變數

source: A variable name. ``id`` holds the name as a string, and ``ctx`` is one of the following types.
ast: 一個變數名稱。``id`` 將名稱以字串形式保存，且 ``ctx`` 是以下型別之一。

source: Variable references can be used to load the value of a variable, to assign a new value to it, or to delete it. Variable references are given a context to distinguish these cases.
ast: 變數參照可用於載入變數的值、為其分配新值或刪除它。變數參照被賦予情境 (context) 來區分這些情況。

source: A ``*var`` variable reference. ``value`` holds the variable, typically a :class:`Name` node. This type must be used when building a :class:`Call` node with ``*args``.
ast: 一個 ``*var`` 變數參照。``value`` 保存變數，通常是一個 :class:`Name` 節點。在使用 ``*args`` 建置 :class:`Call` 節點時必須使用此型別。

source: Expressions
ast: 運算式

source: When an expression, such as a function call, appears as a statement by itself with its return value not used or stored, it is wrapped in this container. ``value`` holds one of the other nodes in this section, a :class:`Constant`, a :class:`Name`, a :class:`Lambda`, a :class:`Yield` or :class:`YieldFrom` node.
ast: 當運算式（例如函式呼叫）本身作為陳述式出現且未使用或儲存其回傳值時，它將被包裝在此容器中。``value`` 保存此區段 (section) 中的一個其他節點：:class:`Constant`、:class:`Name`、:class:`Lambda`、:class:`Yield` 或 :class:`YieldFrom`

source: A unary operation. ``op`` is the operator, and ``operand`` any expression node.
ast: 一元運算 (unary operation)。``op`` 是運算子，``operand`` 是任何運算式節點。

source: Unary operator tokens. :class:`Not` is the ``not`` keyword, :class:`Invert` is the ``~`` operator.
ast: 一元運算子標記。 :class:`Not` 是 ``not`` 關鍵字、:class:`Invert` 是 ``~`` 運算子。

source: A binary operation (like addition or division). ``op`` is the operator, and ``left`` and ``right`` are any expression nodes.
ast: 二元運算 (binary operation)（如加法或除法）。 ``op`` 是運算子、``left`` 和 ``right`` 是任意運算式節點。

source: Binary operator tokens.
ast: 二元運算子 token。

source: A boolean operation, 'or' or 'and'. ``op`` is :class:`Or` or :class:`And`. ``values`` are the values involved. Consecutive operations with the same operator, such as ``a or b or c``, are collapsed into one node with several values.
ast: 布林運算 'or' 或 'and'。``op`` 是 :class:`Or` 或 :class:`And`。``values`` 是有所涉及的值。使用同一運算子的連續操作（例如 ``a or b or c``\ ）會被折疊為具有多個值的一個節點。

source: This doesn't include ``not``, which is a :class:`UnaryOp`.
ast: 這不包括 ``not``，它是一個 :class:`UnaryOp`。

source: Boolean operator tokens.
ast: 布林運算子 token。

source: A comparison of two or more values. ``left`` is the first value in the comparison, ``ops`` the list of operators, and ``comparators`` the list of values after the first element in the comparison.
ast: 兩個或多個值的比較。``left`` 是比較中的第一個值、``ops`` 是運算子串列、``comparators`` 是要比較的第一個元素之後值的串列。

source: Comparison operator tokens.
ast: 比較運算子 token。

source: A function call. ``func`` is the function, which will often be a :class:`Name` or :class:`Attribute` object. Of the arguments:
ast: 一個函式呼叫。``func`` 是該函式，通常是一個 :class:`Name` 或 :class:`Attribute` 物件。而在引數中：

source: ``args`` holds a list of the arguments passed by position.
ast: ``args`` 保存按位置傳遞的引數串列。

source: ``keywords`` holds a list of :class:`.keyword` objects representing arguments passed by keyword.
ast: ``keywords`` 保存一個 :class:`.keyword` 物件串列，表示透過關鍵字傳遞的引數。

source: A keyword argument to a function call or class definition. ``arg`` is a raw string of the parameter name, ``value`` is a node to pass in.
ast: 函式呼叫或類別定義的關鍵字引數。``arg`` 是參數名稱的原始字串，``value`` 是要傳入的節點。

source: An expression such as ``a if b else c``. Each field holds a single node, so in the following example, all three are :class:`Name` nodes.
ast: 像是 ``a if b else c`` 之類的運算式。每個欄位都保存一個節點，因此在以下範例中，所有三個都是 :class:`Name` 節點。

source: Attribute access, e.g. ``d.keys``. ``value`` is a node, typically a :class:`Name`. ``attr`` is a bare string giving the name of the attribute, and ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to how the attribute is acted on.
ast: 屬性的存取，例如 ``d.keys``。``value`` 是一個節點，通常是一個 :class:`Name`。``attr`` 是一個屬性名稱的字串，``ctx`` 根據屬性的作用方式可能是 :class:`Load`、:class:`Store` 或 :class:`Del`。

source: A named expression. This AST node is produced by the assignment expressions operator (also known as the walrus operator). As opposed to the :class:`Assign` node in which the first argument can be multiple nodes, in this case both ``target`` and ``value`` must be single nodes.
ast: 一個附名運算式 (named expression)。該 AST 節點由賦值運算式運算子（也稱為海象運算子）產生。相對於 :class:`Assign` 節點之第一個引數可為多個節點，在這種情況下 ``target`` 和 ``value`` 都必須是單個節點。

source: Subscripting
ast: 下標 (Subscripting)

source: A subscript, such as ``l[1]``. ``value`` is the subscripted object (usually sequence or mapping). ``slice`` is an index, slice or key. It can be a :class:`Tuple` and contain a :class:`Slice`. ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to the action performed with the subscript.
ast: 一個下標，例如 ``l[1]``。``value`` 是下標物件（通常是序列或對映）。``slice`` 是索引、切片或鍵。它可以是一個 :class:`Tuple` 並包含一個 :class:`Slice`。根據下標執行的操作不同，``ctx`` 可以是 :class:`Load`、:class:`Store` 或 :class:`Del`。

source: Regular slicing (on the form ``lower:upper`` or ``lower:upper:step``). Can occur only inside the *slice* field of :class:`Subscript`, either directly or as an element of :class:`Tuple`.
ast: 常規切片（形式為 ``lower:upper`` 或 ``lower:upper:step``\ ）。只能直接或者或者作為 :class:`Tuple` 的元素出現在 :class:`Subscript` 的 *slice* 欄位內。

source: Comprehensions
ast: 綜合運算式 (comprehensions)

source: List and set comprehensions, generator expressions, and dictionary comprehensions. ``elt`` (or ``key`` and ``value``) is a single node representing the part that will be evaluated for each item.
ast: 串列和集合綜合運算、生成器運算式和字典綜合運算。``elt``\ （或 ``key`` 和 ``value``\ ）是單個節點，表示各個項目會被求值 (evaluate) 的部分。

source: ``generators`` is a list of :class:`comprehension` nodes.
ast: ``generators`` 是一個 :class:`comprehension` 節點的串列。

source: One ``for`` clause in a comprehension. ``target`` is the reference to use for each element - typically a :class:`Name` or :class:`Tuple` node. ``iter`` is the object to iterate over. ``ifs`` is a list of test expressions: each ``for`` clause can have multiple ``ifs``.
ast: 綜合運算中的一個 ``for`` 子句。``target`` 是用於每個元素的參照 - 通常是 :class:`Name` 或 :class:`Tuple` 節點。``iter`` 是要疊代的物件。``ifs`` 是測試運算式的串列：每個 ``for`` 子句可以有多個 ``ifs``。

source: ``is_async`` indicates a comprehension is asynchronous (using an ``async for`` instead of ``for``). The value is an integer (0 or 1).
ast: ``is_async`` 表示綜合運算式是非同步的（使用 ``async for`` 而不是 ``for`` ）。該值為整數（0 或 1）。

source: Statements
ast: 陳述式

source: An assignment. ``targets`` is a list of nodes, and ``value`` is a single node.
ast: 一個賦值。``targets`` 是節點串列，``value`` 是單個節點。

source: Multiple nodes in ``targets`` represents assigning the same value to each. Unpacking is represented by putting a :class:`Tuple` or :class:`List` within ``targets``.
ast: ``targets`` 中的多個節點表示為每個節點分配相同的值。解包是透過在 ``targets`` 中放置一個 :class:`Tuple` 或 :class:`List` 來表示的。

source: ``type_comment`` is an optional string with the type annotation as a comment.
ast: ``type_comment`` 是一個可選字串，其中的註解為型別註釋。

source: An assignment with a type annotation. ``target`` is a single node and can be a :class:`Name`, an :class:`Attribute` or a :class:`Subscript`. ``annotation`` is the annotation, such as a :class:`Constant` or :class:`Name` node. ``value`` is a single optional node.
ast: 帶有型別註釋的賦值。``target`` 是單個節點，可以是 :class:`Name`、:class:`Attribute` 或 :class:`Subscript`。``annotation`` 是註釋，例如 :class:`Constant` 或 :class:`Name` 節點。``value`` 是單個可選節點。

source: ``simple`` is always either 0 (indicating a "complex" target) or 1 (indicating a "simple" target). A "simple" target consists solely of a :class:`Name` node that does not appear between parentheses; all other targets are considered complex. Only simple targets appear in the :attr:`__annotations__` dictionary of modules and classes.
ast: ``simple`` 總會是 0（表示一個「複雜」目標）或 1（表示一個「簡單」目標）。一個「簡單」目標僅包含一個 :class:`Name` 節點，且不出現在括號之間；所有其他目標都被視為是複雜的。只有簡單目標會出現在模組和類別的 :attr:`__annotations__` 字典中。

source: Augmented assignment, such as ``a += 1``. In the following example, ``target`` is a :class:`Name` node for ``x`` (with the :class:`Store` context), ``op`` is :class:`Add`, and ``value`` is a :class:`Constant` with value for 1.
ast: 增加賦值 (augmented assignment)，例如 ``a += 1``。在下面的範例中，``target`` 是 ``x`` 的 :class:`Name` 節點（帶有 :class:`Store` 情境），``op`` 是 :class:`Add`，``value`` 是一個值為 1 的 :class:`Constant`。

source: The ``target`` attribute cannot be of class :class:`Tuple` or :class:`List`, unlike the targets of :class:`Assign`.
ast: 與 :class:`Assign` 的目標不同，``target`` 屬性不能屬於 :class:`Tuple` 或 :class:`List` 類別。

source: A ``raise`` statement. ``exc`` is the exception object to be raised, normally a :class:`Call` or :class:`Name`, or ``None`` for a standalone ``raise``. ``cause`` is the optional part for ``y`` in ``raise x from y``.
ast: 一個 ``raise`` 陳述式。``exc`` 是要引發的例外物件，通常是 :class:`Call` 或 :class:`Name`，若是獨立的 ``raise`` 則為 ``None``。``cause`` 是 ``raise x from y`` 中的可選部分 ``y``。

source: An assertion. ``test`` holds the condition, such as a :class:`Compare` node. ``msg`` holds the failure message.
ast: 一個斷言 (assertion)。``test`` 保存條件，例如 :class:`Compare` 節點。``msg`` 保存失敗訊息。

source: Represents a ``del`` statement. ``targets`` is a list of nodes, such as :class:`Name`, :class:`Attribute` or :class:`Subscript` nodes.
ast: 代表一個 ``del`` 陳述式。``targets`` 是節點串列，例如 :class:`Name`、:class:`Attribute` 或 :class:`Subscript` 節點。

source: A ``pass`` statement.
ast: 一個 ``pass`` 陳述式。

source: A :ref:`type alias <type-aliases>` created through the :keyword:`type` statement. ``name`` is the name of the alias, ``type_params`` is a list of :ref:`type parameters <ast-type-params>`, and ``value`` is the value of the type alias.
ast: 透過 :keyword:`type` 陳述式建立的\ :ref:`型別別名 (type alias) <type-aliases>`。``name`` 是別名的名稱、``type_params`` 是\ :ref:`型別參數 (type parameter) <ast-type-params>` 的串列、``value`` 是型別別名的值。

source: Other statements which are only applicable inside functions or loops are described in other sections.
ast: 其他僅適用於函式或迴圈內部的陳述式將在其他部分中描述。

source: Imports
ast: 引入 (imports)

source: An import statement. ``names`` is a list of :class:`alias` nodes.
ast: 一個 import 陳述式。``names`` 是 :class:`alias` 節點的串列。

source: Represents ``from x import y``. ``module`` is a raw string of the 'from' name, without any leading dots, or ``None`` for statements such as ``from . import foo``. ``level`` is an integer holding the level of the relative import (0 means absolute import).
ast: 代表 ``from x import y``。``module`` 是 'from' 名稱的原始字串，前面沒有任何的點 (dot)，或者對於諸如 ``from . import foo`` 之類的陳述式則為 ``None``。``level`` 是一個整數，保存相對引入的級別（0 表示絕對引入）。

source: Both parameters are raw strings of the names. ``asname`` can be ``None`` if the regular name is to be used.
ast: 這兩個參數都是名稱的原始字串。如果要使用常規名稱，``asname`` 可以為 ``None``。

source: Control flow
ast: 流程控制

source: Optional clauses such as ``else`` are stored as an empty list if they're not present.
ast: 諸如 ``else`` 之類的可選子句如果不存在，則將被儲存為空串列。

source: An ``if`` statement. ``test`` holds a single node, such as a :class:`Compare` node. ``body`` and ``orelse`` each hold a list of nodes.
ast: 一個 ``if`` 陳述式。``test`` 保存單個節點，例如 :class:`Compare` 節點。``body`` 和 ``orelse`` 各自保存一個節點串列。

source: ``elif`` clauses don't have a special representation in the AST, but rather appear as extra :class:`If` nodes within the ``orelse`` section of the previous one.
ast: ``elif`` 子句在 AST 中沒有特殊表示，而是在前一個子句的 ``orelse`` 部分中作為額外的 :class:`If` 節點出現。

source: A ``for`` loop. ``target`` holds the variable(s) the loop assigns to, as a single :class:`Name`, :class:`Tuple`, :class:`List`, :class:`Attribute` or :class:`Subscript` node. ``iter`` holds the item to be looped over, again as a single node. ``body`` and ``orelse`` contain lists of nodes to execute. Those in ``orelse`` are executed if the loop finishes normally, rather than via a ``break`` statement.
ast: 一個 ``for`` 迴圈。 ``target`` 保存迴圈賦予的變數，為單個 :class:`Name`、:class:`Tuple`、:class:`List`、:class:`Attribute` 或 :class:`Subscript` 節點。``iter`` 保存要迴圈跑過的項目，也為單個節點。``body`` 和 ``orelse`` 包含要執行的節點串列。如果迴圈正常完成，則執行 ``orelse`` 中的內容，而不是透過 ``break`` 陳述式執行。

source: A ``while`` loop. ``test`` holds the condition, such as a :class:`Compare` node.
ast: 一個 ``while`` 迴圈。``test`` 保存條件，例如 :class:`Compare` 節點。

source: The ``break`` and ``continue`` statements.
ast: ``break`` 和 ``continue`` 陳述式。
