Repository: python/python-docs-zh-tw
Catalog: library/*.po
Languages: ast

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
ast: 對於屬於陳述式總集 (collection) 一部分的節點（適用於所有陳述式節點），訪問者還可以回傳節點串列，而不僅僅是單個節點。

source: If :class:`NodeTransformer` introduces new nodes (that weren't part of original tree) without giving them location information (such as :attr:`~ast.AST.lineno`), :func:`fix_missing_locations` should be called with the new sub-tree to recalculate the location information::
ast: 如果 :class:`NodeTransformer` 引進了新節點（不屬於原始樹的一部分），但沒有給它們提供位置資訊（例如 :attr:`~ast.AST.lineno`\ ），則應使用新的子樹呼叫 :func:`fix_missing_locations` 以重新計算位置資訊： ::

source: Usually you use the transformer like this::
ast: 你通常會像這樣使用 transformer： ::

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. If *annotate_fields* is true (by default), the returned string will show the names and the values for fields. If *annotate_fields* is false, the result string will be more compact by omitting unambiguous field names. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to true.
ast: 回傳 *node* 中樹的格式化傾印 (formatted dump)，這主要用於除錯。如果 *annotate_fields* 為 true（為預設值），則回傳的字串將顯示欄位的名稱和值。如果 *annotate_fields* 為 false，則透過省略明確的欄位名稱，結果字串將更加縮減簡潔。預設情況下，不會傾印列號和行偏移量等屬性。如果需要，可以設定 *include_attributes* 為 true。

source: If *indent* is a non-negative integer or string, then the tree will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the single line representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ast: 如果 *indent* 是非負整數或字串，那麼樹將使用該縮排級別來做漂亮印出 (pretty-print)。縮排級別 0、負數或 ``""`` 只會插入換列符號 (newlines)。``None``\ （預設值）代表選擇單列表示。使用正整數縮排可以在每個級別縮排相同數量的空格。如果 *indent* 是一個字串（例如 ``"\t"``\ ），則該字串用於縮排每個級別。

source: Added the *indent* option.
ast: 新增 *indent* 選項。

source: Compiler Flags
ast: 編譯器旗標

source: The following flags may be passed to :func:`compile` in order to change effects on the compilation of a program:
ast: 可以將以下旗標傳遞給 :func:`compile` 以變更對程式的編譯效果：

source: Enables support for top-level ``await``, ``async for``, ``async with`` and async comprehensions.
ast: 啟用對最高階 ``await``、``async for``、``async with`` 和非同步綜合運算的支援。

source: Generates and returns an abstract syntax tree instead of returning a compiled code object.
ast: 生成並回傳抽象語法樹，而不是回傳已編譯的程式碼物件。

source: Enables support for :pep:`484` and :pep:`526` style type comments (``# type: <type>``, ``# type: ignore <stuff>``).
ast: 啟用對 :pep:`484` 和 :pep:`526` 樣式型別註釋的支援 (``# type: <type>``, ``# type: ignore <stuff>``)。

source: Command-Line Usage
ast: 命令列用法

source: The :mod:`ast` module can be executed as a script from the command line. It is as simple as:
ast: :mod:`ast` 模組可以作為腳本從命令列執行，可以像這樣簡單地做到：

source: The following options are accepted:
ast: 以下選項可被接受：

source: Show the help message and exit.
ast: 顯示幫助訊息並退出。

source: Specify what kind of code must be compiled, like the *mode* argument in :func:`parse`.
ast: 指定必須編譯哪種類型的程式碼，像是 :func:`parse` 中的 *mode* 引數。

source: Don't parse type comments.
ast: 不要剖析型別註解。

source: Include attributes such as line numbers and column offsets.
ast: 包括列號和行偏移量等屬性。

source: Indentation of nodes in AST (number of spaces).
ast: AST 中節點的縮進（空格數）。

source: If :file:`infile` is specified its contents are parsed to AST and dumped to stdout. Otherwise, the content is read from stdin.
ast: 如果指定了 :file:`infile`，則其內容將被剖析為 AST 並傾印 (dump) 到 stdout。否則會從 stdin 讀取內容。

source: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, an external documentation resource, has good details on working with Python ASTs.
ast: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_ 是一個外部文件資源，提供了有關使用 Python AST 的詳細資訊。

source: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ annotates Python ASTs with the positions of tokens and text in the source code that generated them. This is helpful for tools that make source code transformations.
ast: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ 使用生成它們的原始碼中的標記和文本的位置來註釋 Python AST。這對於進行原始碼轉換的工具很有幫助。

source: `leoAst.py <https://leo-editor.github.io/leo-editor/appendices.html#leoast-py>`_ unifies the token-based and parse-tree-based views of python programs by inserting two-way links between tokens and ast nodes.
ast: `leoAst.py <https://leo-editor.github.io/leo-editor/appendices.html#leoast-py>`_ 透過在 token 和 ast 節點之間插入雙向鏈結，統一了 python 程式的基於 token 和基於剖析樹的視圖。

source: `LibCST <https://libcst.readthedocs.io/>`_ parses code as a Concrete Syntax Tree that looks like an ast tree and keeps all formatting details. It's useful for building automated refactoring (codemod) applications and linters.
ast: `LibCST <https://libcst.readthedocs.io/>`_ 將程式碼剖析為具體語法樹 (Concrete Syntax Tree)，看起來像 ast 樹並保留所有格式詳細資訊。它對於建置自動重構 (codemod) 應用程式和 linter 非常有用。

source: `Parso <https://parso.readthedocs.io>`_ is a Python parser that supports error recovery and round-trip parsing for different Python versions (in multiple Python versions). Parso is also able to list multiple syntax errors in your Python file.
ast: `Parso <https://parso.readthedocs.io>`_ 是一個 Python 剖析器，支援不同 Python 版本的錯誤復原和往返剖析。Parso 還能夠列出 Python 檔案中的多個語法錯誤。

source: ? (question mark)
ast: ? （問號）

source: in AST grammar
ast: 於 AST 文法中

source: * (asterisk)
ast: * （星號）
